Feature: Достъп до оценка на дете

	Background:
		Given Потребител отваря екран за достъп до оценки на дете

  Scenario: Достъп до оценка на негово дете
  	And Потребителят има роля: "par"
    When Въведе имейл на дете: "child@abv.bg";
    And Натисне бутон за проверка
    Then Вижда съобщение: "Достъп разрешен!"
    
  Scenario: Достъп до оценка с невалидни роли
  	And Потребителят има роля: "stu"
    When Въведе имейл на дете: "child@abv.bg";
    And Натисне бутон за проверка
    Then Вижда съобщение: "Невалидни роли!"
    
  Scenario: Достъп до оценка с невалиден имейл
  	And Потребителят има роля: "par"
    When Въведе имейл на дете: "wrong@abv.bg";
    And Натисне бутон за проверка
    Then Вижда съобщение: "Невалиден имейл!"
    
  Scenario: Достъп до оценка на чуждо дете
  	And Потребителят има роля: "par"
    When Въведе имейл на дете: "child2@abv.bg";
    And Натисне бутон за проверка
    Then Вижда съобщение: "Достъп отказан!"
